{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "embedding_32", "class_name": "Embedding", "config": {"name": "embedding_32", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 200, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "s0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "s0"}, "inbound_nodes": []}, {"name": "bidirectional_29", "class_name": "Bidirectional", "config": {"name": "bidirectional_29", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_11", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_32", 0, 0, {}]]]}, {"name": "repeat_vector_19", "class_name": "RepeatVector", "config": {"name": "repeat_vector_19", "trainable": true, "n": 15}, "inbound_nodes": [[["s0", 0, 0, {}]], [["lstm_10", 0, 0, {}]], [["lstm_10", 1, 0, {}]], [["lstm_10", 2, 0, {}]], [["lstm_10", 3, 0, {}]], [["lstm_10", 4, 0, {}]], [["lstm_10", 5, 0, {}]], [["lstm_10", 6, 0, {}]], [["lstm_10", 7, 0, {}]], [["lstm_10", 8, 0, {}]], [["lstm_10", 9, 0, {}]], [["lstm_10", 10, 0, {}]], [["lstm_10", 11, 0, {}]], [["lstm_10", 12, 0, {}]], [["lstm_10", 13, 0, {}]], [["lstm_10", 14, 0, {}]], [["lstm_10", 15, 0, {}]], [["lstm_10", 16, 0, {}]], [["lstm_10", 17, 0, {}]], [["lstm_10", 18, 0, {}]], [["lstm_10", 19, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 0, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 1, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 2, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 3, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 4, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 5, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 6, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 7, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 8, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 9, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 10, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 11, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 12, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 13, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 14, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 15, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 16, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 17, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 18, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 19, 0, {}]], [["bidirectional_29", 0, 0, {}], ["repeat_vector_19", 20, 0, {}]]]}, {"name": "dense_41", "class_name": "Dense", "config": {"name": "dense_41", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]], [["concatenate_5", 1, 0, {}]], [["concatenate_5", 2, 0, {}]], [["concatenate_5", 3, 0, {}]], [["concatenate_5", 4, 0, {}]], [["concatenate_5", 5, 0, {}]], [["concatenate_5", 6, 0, {}]], [["concatenate_5", 7, 0, {}]], [["concatenate_5", 8, 0, {}]], [["concatenate_5", 9, 0, {}]], [["concatenate_5", 10, 0, {}]], [["concatenate_5", 11, 0, {}]], [["concatenate_5", 12, 0, {}]], [["concatenate_5", 13, 0, {}]], [["concatenate_5", 14, 0, {}]], [["concatenate_5", 15, 0, {}]], [["concatenate_5", 16, 0, {}]], [["concatenate_5", 17, 0, {}]], [["concatenate_5", 18, 0, {}]], [["concatenate_5", 19, 0, {}]], [["concatenate_5", 20, 0, {}]]]}, {"name": "attention_weights", "class_name": "Activation", "config": {"name": "attention_weights", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_41", 0, 0, {}]], [["dense_41", 1, 0, {}]], [["dense_41", 2, 0, {}]], [["dense_41", 3, 0, {}]], [["dense_41", 4, 0, {}]], [["dense_41", 5, 0, {}]], [["dense_41", 6, 0, {}]], [["dense_41", 7, 0, {}]], [["dense_41", 8, 0, {}]], [["dense_41", 9, 0, {}]], [["dense_41", 10, 0, {}]], [["dense_41", 11, 0, {}]], [["dense_41", 12, 0, {}]], [["dense_41", 13, 0, {}]], [["dense_41", 14, 0, {}]], [["dense_41", 15, 0, {}]], [["dense_41", 16, 0, {}]], [["dense_41", 17, 0, {}]], [["dense_41", 18, 0, {}]], [["dense_41", 19, 0, {}]], [["dense_41", 20, 0, {}]]]}, {"name": "dot_3", "class_name": "Dot", "config": {"name": "dot_3", "trainable": true, "axes": 1, "normalize": false}, "inbound_nodes": [[["attention_weights", 0, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 1, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 2, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 3, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 4, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 5, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 6, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 7, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 8, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 9, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 10, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 11, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 12, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 13, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 14, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 15, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 16, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 17, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 18, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 19, 0, {}], ["bidirectional_29", 0, 0, {}]], [["attention_weights", 20, 0, {}], ["bidirectional_29", 0, 0, {}]]]}, {"name": "c0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "name": "c0"}, "inbound_nodes": []}, {"name": "lstm_10", "class_name": "LSTM", "config": {"name": "lstm_10", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dot_3", 0, 0, {}], ["s0", 0, 0, {}], ["c0", 0, 0, {}]], [["dot_3", 1, 0, {}], ["lstm_10", 0, 0, {}], ["lstm_10", 0, 2, {}]], [["dot_3", 2, 0, {}], ["lstm_10", 1, 0, {}], ["lstm_10", 1, 2, {}]], [["dot_3", 3, 0, {}], ["lstm_10", 2, 0, {}], ["lstm_10", 2, 2, {}]], [["dot_3", 4, 0, {}], ["lstm_10", 3, 0, {}], ["lstm_10", 3, 2, {}]], [["dot_3", 5, 0, {}], ["lstm_10", 4, 0, {}], ["lstm_10", 4, 2, {}]], [["dot_3", 6, 0, {}], ["lstm_10", 5, 0, {}], ["lstm_10", 5, 2, {}]], [["dot_3", 7, 0, {}], ["lstm_10", 6, 0, {}], ["lstm_10", 6, 2, {}]], [["dot_3", 8, 0, {}], ["lstm_10", 7, 0, {}], ["lstm_10", 7, 2, {}]], [["dot_3", 9, 0, {}], ["lstm_10", 8, 0, {}], ["lstm_10", 8, 2, {}]], [["dot_3", 10, 0, {}], ["lstm_10", 9, 0, {}], ["lstm_10", 9, 2, {}]], [["dot_3", 11, 0, {}], ["lstm_10", 10, 0, {}], ["lstm_10", 10, 2, {}]], [["dot_3", 12, 0, {}], ["lstm_10", 11, 0, {}], ["lstm_10", 11, 2, {}]], [["dot_3", 13, 0, {}], ["lstm_10", 12, 0, {}], ["lstm_10", 12, 2, {}]], [["dot_3", 14, 0, {}], ["lstm_10", 13, 0, {}], ["lstm_10", 13, 2, {}]], [["dot_3", 15, 0, {}], ["lstm_10", 14, 0, {}], ["lstm_10", 14, 2, {}]], [["dot_3", 16, 0, {}], ["lstm_10", 15, 0, {}], ["lstm_10", 15, 2, {}]], [["dot_3", 17, 0, {}], ["lstm_10", 16, 0, {}], ["lstm_10", 16, 2, {}]], [["dot_3", 18, 0, {}], ["lstm_10", 17, 0, {}], ["lstm_10", 17, 2, {}]], [["dot_3", 19, 0, {}], ["lstm_10", 18, 0, {}], ["lstm_10", 18, 2, {}]], [["dot_3", 20, 0, {}], ["lstm_10", 19, 0, {}], ["lstm_10", 19, 2, {}]]]}, {"name": "dense_42", "class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "units": 345, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_10", 0, 0, {}]], [["lstm_10", 1, 0, {}]], [["lstm_10", 2, 0, {}]], [["lstm_10", 3, 0, {}]], [["lstm_10", 4, 0, {}]], [["lstm_10", 5, 0, {}]], [["lstm_10", 6, 0, {}]], [["lstm_10", 7, 0, {}]], [["lstm_10", 8, 0, {}]], [["lstm_10", 9, 0, {}]], [["lstm_10", 10, 0, {}]], [["lstm_10", 11, 0, {}]], [["lstm_10", 12, 0, {}]], [["lstm_10", 13, 0, {}]], [["lstm_10", 14, 0, {}]], [["lstm_10", 15, 0, {}]], [["lstm_10", 16, 0, {}]], [["lstm_10", 17, 0, {}]], [["lstm_10", 18, 0, {}]], [["lstm_10", 19, 0, {}]], [["lstm_10", 20, 0, {}]]]}], "input_layers": [["input_16", 0, 0], ["s0", 0, 0], ["c0", 0, 0]], "output_layers": [["dense_42", 0, 0], ["dense_42", 1, 0], ["dense_42", 2, 0], ["dense_42", 3, 0], ["dense_42", 4, 0], ["dense_42", 5, 0], ["dense_42", 6, 0], ["dense_42", 7, 0], ["dense_42", 8, 0], ["dense_42", 9, 0], ["dense_42", 10, 0], ["dense_42", 11, 0], ["dense_42", 12, 0], ["dense_42", 13, 0], ["dense_42", 14, 0], ["dense_42", 15, 0], ["dense_42", 16, 0], ["dense_42", 17, 0], ["dense_42", 18, 0], ["dense_42", 19, 0], ["dense_42", 20, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}